Revit 2026 API

# AnalysisDisplayColorSettingsMinColor Property

---

Color assigned to the minimum value.

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Color MinColor { get; set; }
```
```vb
Public Property MinColor As Color
	Get
	Set
```
```cpp
public:
property Color^ MinColor {
	Color^ get ();
	void set (Color^ value);
}
```
```fsharp
member MinColor : Color with get, set
```

#### Property Value

Color

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

#### Reference

AnalysisDisplayColorSettings Class

Autodesk.Revit.DB.Analysis Namespace